Tekla Open API Reference for Tekla Structures 2025
Site Methods
The LogicalAreaFilterExpressions.Site type exposes the following members.
Methods
Name | Description
ToString
 Creates a string representation of the current object.
 (Inherited from DataFilterExpression.)
Top
See Also
Reference
LogicalAreaFilterExpressions.Site Class
Tekla.Structures.Filtering.Categories Namespace